django_ab_test_result.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.50 (be patient).....done


Server Software:        WSGIServer/0.1
Server Hostname:        192.168.1.50
Server Port:            8001

Document Path:          /
Document Length:        2017 bytes

Concurrency Level:      100
Time taken for tests:   2.026 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Non-2xx responses:      100
Total transferred:      217200 bytes
HTML transferred:       201700 bytes
Requests per second:    49.37 [#/sec] (mean)
Time per request:       2025.611 [ms] (mean)
Time per request:       20.256 [ms] (mean, across all concurrent requests)
Transfer rate:          104.71 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   82 272.1      0    1000
Processing:    23  313 262.7    274    1945
Waiting:       11  294 262.6    256    1927
Total:         24  395 409.9    275    2010

Percentage of the requests served within a certain time (ms)
  50%    275
  66%    292
  75%    304
  80%    325
  90%   1255
  95%   1307
  98%   2008
  99%   2010
 100%   2010 (longest request)